## Setup the environment

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Object Creation
Creating series which are one dimensional ndarray with axis labels

In [2]:
s=pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Creating a Data Frame by passing a numpy array, with a dattime index and labeled columns:

In [3]:
dates=pd.date_range('20130101',periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

Use the generated dates column to set up the rownames for the next data frame

In [5]:
df=pd.DataFrame(np.random.randn(6,4),index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.067085  0.307651  0.076259 -0.398497
2013-01-02  1.381004 -0.695469 -0.934102  0.305795
2013-01-03  0.207893 -0.539180  1.392446  0.271679
2013-01-04  1.181115 -1.307966 -0.358143  0.966294
2013-01-05 -0.147092 -0.835412 -0.718147  1.520685
2013-01-06 -0.640880  1.916561  1.522467 -0.306380

Create a dataframe by passing a dictionary of objects that can be converted to series like

In [8]:
df2=pd.DataFrame({'A':1.,
                  'B':pd.Timestamp('20130102'),
                  'C':pd.Series(1,index=list(range(4)),dtype='float32'),
                  'D':np.array([3]*4,dtype='int32'),
                  'E':pd.Categorical(['test','train','test','train']),
                 'F':'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [9]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Viewing the data

In [11]:
df.head()

                   A         B         C         D
2013-01-01  0.067085  0.307651  0.076259 -0.398497
2013-01-02  1.381004 -0.695469 -0.934102  0.305795
2013-01-03  0.207893 -0.539180  1.392446  0.271679
2013-01-04  1.181115 -1.307966 -0.358143  0.966294
2013-01-05 -0.147092 -0.835412 -0.718147  1.520685

In [12]:
df2.head()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo